app/controllers/reservations_controller.rb

	def create
		@reservation = Reservation.new(reservation_params)
		@reservation.save
---
INSERT INTO "reservations" ("created_at", "dropoff_time", "pickup_location", "pickup_time", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"